# Создайте класс Student, конструктор которого имеет параметры name, lastname,
# department, year_of_entrance. Добавьте метод get_student_info, который
# возвращает имя, фамилию, год поступления и факультет в
# отформатированном виде: “Вася Иванов поступил в 2017 г. на факультет:
# Программирование.”


class Student:
    def __init__(self, name, lastname, department, year_of_entrance):
        self.name = name
        self.lastname = lastname
        self.department = department
        self.year_of_entrance = year_of_entrance
        self.info = name + lastname + 'entered ' + department + 'in ' + year_of_entrance

student1 = Student('Zhanara ', 'Kurmanbaeva ', 'AUCA ', '2020 ') 
print(student1.info)